{
  "basics": {
    "name": "Ben Finkelshtein",
    "image": "",
    "email": "ben.finkelshtein@cs.ox.ac.uk",
    "url": "https://www.linkedin.com/in/ben-finkelshtein/",
    "summary": "PhD candidate at the University of Oxford under the supervision of Prof. Michael Bronstein and Dr. Ismail Ilkan Ceylan. With extensive experience in both academia and industry, I have worked on areas such as natural language processing, anomaly detection, and time series forecasting.",
    "profiles": [
      {
        "network": "Google Scholar",
        "url": "https://scholar.google.com/citations?user=goWM7VwAAAAJ&hl=iw"
      },
      {
        "network": "LinkedIn",
        "username": "Ben Finkelshtein",
        "url": "https://www.linkedin.com/in/ben-finkelshtein/"
      },
      {
        "network": "Twitter",
        "username": "benfinkelshtein",
        "url": "https://twitter.com/benfinkelshtein"
      }
    ]
  },
  "education": [
    {
      "institution": "University of Oxford",
      "area": "Computer Science",
      "studyType": "Ph.D",
      "startDate": "2023-01-01",
      "score": ""
    },
    {
      "institution": "Technion - Israel Institute of Technology",
      "area": "Computer Science",
      "studyType": "M.Sc",
      "startDate": "2019-11-01",
      "endDate": "2022-06-01",
      "score": "99.1"
    },
    {
      "institution": "Technion - Israel Institute of Technology",
      "area": "Electrical Engineering and Physics",
      "studyType": "B.Sc",
      "startDate": "2013-11-01",
      "endDate": "2017-07-01",
      "score": "92.1"
    }
  ],
  "publications": [
    {
      "name": "Learning on Large Graphs using Intersecting Communities",
      "url": "https://arxiv.org/abs/2405.20724",
      "summary": "A new and fundamentally different pipeline for learning on very large non-sparse graphs using intersecting communities.",
      "selected": true
    },
    {
      "name": "Graph Neural Network Outputs are Almost Surely Asymptotically Constant",
      "url": "https://arxiv.org/abs/2403.03880",
      "summary": "A new angle on the expressive power of GNNs by studying  how the predictions of a GNN probabilistic classifier evolve."
    },
    {
      "name": "Cooperative Graph Neural Networks",
      "publisher": "ICML 2024",
      "url": "https://arxiv.org/abs/2310.01267",
      "summary": "A more dynamic and flexible message-passing paradigm in which each node can choose a different communication strategy.",
      "selected": true
    },
    {
      "name": "Strategic Classification with Graphs Neural Networks",
      "publisher": "ICLR 2023",
      "url": "https://openreview.net/forum?id=TuHkVOjSAR",
      "summary": "Learning in a setting where users that are dependant can modify their features to obtain favorable predictions."
    },
    {
      "name": "A Simple and Universal Rotation Equivariant Point-cloud Network",
      "publisher": "ICML TAG in ML Workshop 2022",
      "url": "https://arxiv.org/abs/2203.01216",
      "summary": "A simple architecture which is equivariant to rigid motions with the ability to approximate any equivariant function."
    },
    {
      "name": "Single-Node Attack for Fooling Graph Neural Networks",
      "publisher": "Neurocomputing journal by Elsevier",
      "url": "https://www.sciencedirect.com/science/article/abs/pii/S0925231222012012",
      "summary": "Showcased that GNNs are vulnerable to a realistic single-node adversarial attack, even when the attacker cannot be chosen."
    }
    ],
  "work": [
    {
      "name": "eBay",
      "position": "Applied Researcher",
      "url": "",
      "startDate": "2022-06-01",
      "endDate": "2023-01-01",
      "summary": "Engineered NLP models to optimize search query relevance for landing pages, enhancing search engine optimization. Developed a keyword extraction technique integrated with GPT, resulting in a 30% increase in click-through rates within three months."
    },
    {
      "name": "SKF Group, AI Center of Excellence",
      "position": "Data Scientist",
      "url": "",
      "startDate": "2020-08-01",
      "endDate": "2021-05-01",
      "summary": "Led research in event prediction, anomaly detection, and time series forecasting for machinery fault diagnosis at SKF. Designed and implemented machine learning pipelines and developed an event-based evaluation metric that boosted anomaly detection accuracy from 78% to 90%."
    },
    {
      "name": "Rafael Advanced Defense Systems",
      "position": "Algorithm Developer and Physicist",
      "url": "",
      "startDate": "2017-10-01",
      "endDate": "2020-07-01",
      "summary": "Developed a neural network to predict n-body problem solutions for astronomy or aerodynamics in a classified setting. Created physics-based simulations to enhance model comparison, improving prediction accuracy by 21%. Performed data processing and statistical analysis on confidential data, presenting findings in a detailed report and presentation."
    }
  ],
  "teaching": [
    {
      "name": "University of Oxford, Faculty of Computer Science",
      "position": "Head Teaching Assistant",
      "url": "",
      "startDate": "2023-01-01",
      "summary": "Head TA for Geometric Deep Learning and Graph Representation Learning courses, responsible over the other TAs, creating coding assignments and guiding 20 students through coursework."
    },
    {
      "name": "Blue Education",
      "position": "Tutor",
      "url": "",
      "startDate": "2023-07-01",
      "endDate": "2024-01-01",
      "summary": "Taught Math, Physics, and Computer Science for A-Levels, SAT, and college exams as an online part-time tutor."
    },
    {
      "name": "Technion - Israel Institute of Technology, Faculty of Computer Science",
      "position": "Head Teaching Assistant",
      "url": "",
      "startDate": "2021-03-01",
      "endDate": "2022-06-01",
      "summary": "Head TA for the Geometric Deep Learning course, supervising 40 students and developing tutorials and code notebooks for the course."
    },
    {
      "name": "Matematix – High-School and College Exam Preparation Center",
      "position": "Teacher",
      "url": "",
      "startDate": "2012-07-01",
      "endDate": "2013-11-01",
      "summary": "Taught Mathematics, Physics, English, and Coding for matriculation, SAT, and college exams, leading sessions of 30 students."
    }
  ],
  "awards": [
    {
      "title": "Clarendon Fund Scholarship towards overseas tuition fees and living costs",
      "date": "2023-01-01"
    }
  ]
}
